    // +, -, /, *, -(Эти понятные да что за штучки?)

    // >, <, %, ==, -(Это математические действия!)

    // !=
    //  -(Должно быть неравным!)

    //  || -(Это значит ИЛИ!)
    // && -(А это наобарот И!-and!)
    // document.write("Hello my bro"); -(вывводит текст просто на экран!)

    // console.log(10 + "5"); -(ввыводит инфо в консоль!)

    // console.info("Idi nahyi"); -(тоже самое инфо на консл!)

    // console.error("NAHER IDI BLYAT"); -(ввыводи инфо в консл как ошибку!)

    // console.warn("A TI NE IDI NAHER") -(выводит инфо в консл как предупреждение)
    // let man = 10; -(Переменный или сундук! или же хранилище!)

    // const man = "mimi"; -(тоже самое но его начално заданую значение вообще нелзья изменит!)
    // let man = true; -(значение Истена!)

    // let man = false; -(Значение Неверно!)

    // let name_is = Number("6.7"); -(Попытается Превращает строку в числа)

    // let name_no = Number("18"); -(строк в число)

    // console.log("Вычетание:-" + (name_is + name_no)); -(то что в этих() у них более примущество!)

    // console.log("Math: " + Math.PI) -(показвовает число пи!)

    // console.log("Math: " + Math.E) -(показвовает число E)

    // console.log("Math: " + Math.min(2, 5, 9, 3, 8, -9)) -(находит маленкую число!)

    // console.log("Math: " + Math.max(2, 5, 9, 3, 8, -9)) -(находит самое балшое число, значение!)

    /* let name_it = 5; -(в имя есть цифра 5!)
    if (name_it == 5) { -(условия! если в name_it есть число пять тогда-)
    console.log(name_it); -(тогда в консоле отрабражается значение который держит name_it)
    }*/

    /* else if(name_it == 5) { -(если if не смог то еще доп проверку сделает это! порпобует это!)
    console.log("Ok!")
    } */

    /* else { -(это тогда когда код не выполнился то есть else if не сработал!)
    console.log("Error!");
    } */

    // (Чтобы делать которкие проверки просто ставим имя самой перемнной и все он будет искат значение true! а если перед переменным постаавить значение ! то он будет искать false!)

    /* let mansik = 5;

    switch (mansik) {
        case 5:
            console.log("It's number!");
                break;
                default:
                console.log("Ok!");

    -(Кста символы сюда нелзя! это не сравниние значение а проверка значений он ли он!!)
    -(Крч switch выберает переменую который будем проверят!)
    -(case потом значение который не или должен исползововатся)
    -(и внизу что должно тогда пройзойти!)
    -(и саммой конец всегда ставим break; !!!)
    -(и дефолт ну типо если ничего там не подошло!)
} */

    /*     let arma = ["arma", 250, true, -250];
    arma[3] = "sosis";
    console.log(arma[3]);
    console.log(arma.length); -(.lenght -Это считает и показвовает сколко же элементов там!)

    let matrix = [
        [10, 20, 30], ["menma", "mansik", "kaepra"], [true, false]
    ]
    console.log(matrix[1][1]);

    -(многомрные массивы это когда в одной переменной хранится более несколко элементов через [] и внутри записвоваеш различные значения с помощю запетой (,) и чтобы обратится к конкретнуму значеню нужно исползововать [] потом по индексу указать номерацую этого значени а ииндекс номераций всегда начиналось с нуля! 1-й элемент который ты видеш начинается с 0 а второй который видеш это 1! с много мерными точно так же!)
    */

    /*     for (let i = 0; i <= 10; i++) {
        console.log(i);
    } */

    /* let j = 1000;
    while(j >= 100) {
        console.log(j);
        j -= 100;
    } */

    /* let  x = 50;
    do {
    console.log(x);
    x / 2;
    } while(x <= 10); */

/*     for(let i = 10; i <= 20; i += 2) {
    if( i > 15)
        break;
    console.log(i);
} */

    /* for(let i = 10; i <= 20; i ++) {
    if(i % 2 == 0)
        continue;
    console.log(i);
} */

    /* let arma = [1,2,3,4,5,6,7,8,9, "strochka"]
console.log(arma.length);

    for(let i = 0; i < arma.length; i++) {
    console.log("Element: " + (i + 1) + ":" + arma[i]);
} */

    // alert("Welcome to new time"); -(Просто Вызывает инфо окно!)

    // confirm("Are You now at home?"); -(Вызывает окно с конопкой "да" или "нет")

    // prompt("Who are you?"); -(Всплывает окно с инпутским запросом!)

/*     function menma(world_of_war) {   -(Функция создона!)
    console.log(world_of_war + "Aha'eo!"); -(То что он делает в квадратных скобках!)
}
menma("Hello My Texher!");  -(Призвал функцую в действую!)*/

/* console.log(+"5" + +"5");
    -(крч если ставить перед стракой + то он попытаетс преобазавать это в число!) */